{
  "characterId": "emma",
  "characterName": "Emma",
  "introduction": {
    "lines": [
      "Oh, hello! I'm Emma. Lovely to meet you.",
      "Valentin always throws such wonderful parties.",
      "I can't wait to try his erdbeerstrudel - everyone raves about it!"
    ],
    "recordInNotebook": true,
    "notebookNote": "Emma seems excited about the party and Valentin's famous strudel."
  },
  "postIncident": [
    {
      "tier": 0,
      "requiredClues": 0,
      "lines": [
        "This is absolutely dreadful! Valentin worked so hard on that strudel.",
        "I was by the bookshelf admiring his collection when he stepped out.",
        "I... I noticed the plate from across the room. It looked so beautiful with those strawberries on top."
      ],
      "followUpLines": [
        "I'm not usually one to watch desserts, but it was calling to me.",
        "Several people were moving around. It's hard to say who was where.",
        "Maybe check the area around the dessert table for evidence?"
      ],
      "recordInNotebook": true,
      "notebookNote": "Emma was by the bookshelf during the incident. Noticed the strudel from across the room - admits it was calling to her."
    },
    {
      "tier": 1,
      "requiredClues": 1,
      "lines": [
        "You found crumbs? Well, yes, I suppose that makes sense...",
        "I did notice someone wiping their hands on a napkin. Very deliberately.",
        "Oh! Valentin has recipe notes on his desk. I saw him scribbling on them earlier with... strong opinions."
      ],
      "followUpLines": [
        "The desk might tell you who had issues with the recipe.",
        "I'm just trying to be helpful. I didn't do anything wrong!",
        "Whoever ate it must have left more evidence than just crumbs..."
      ],
      "recordInNotebook": true,
      "notebookNote": "Emma saw someone wiping their hands deliberately. She also knows about Valentin's recipe notes - has she been snooping?",
      "unlocksClues": ["desk-papers"]
    },
    {
      "tier": 2,
      "requiredClues": 3,
      "lines": [
        "Alright, fine. I'll tell you what I really saw.",
        "Luca was near the dessert table. He had this... guilty look. Furtive.",
        "And I heard him mutter something about 'finally trying the legendary strudel.' That's suspicious, right?"
      ],
      "followUpLines": [
        "He's new here. Maybe he didn't understand how sacred Valentin's baking is?",
        "I didn't want to throw him under the carriage, but you need to know.",
        "Check behind the bookshelf. I saw him glance that direction nervously."
      ],
      "recordInNotebook": true,
      "notebookNote": "Emma claims Luca was near the table acting suspiciously and muttered about trying the strudel. Reliable witness or deflecting blame?"
    },
    {
      "tier": 3,
      "requiredClues": 5,
      "lines": [
        "*sighs* I need to come completely clean.",
        "I was... tempted. Very tempted. I stood by the table for a moment, inhaling the aroma.",
        "But I didn't touch it! When I was there, I noticed the plate was already disturbed. Someone beat me to it."
      ],
      "followUpLines": [
        "I saw powdered sugar on someone's sleeve, but I can't remember whose...",
        "Multiple people were near that table at different times.",
        "I wanted it so badly, but I respected Valentin's wishes. Not everyone did."
      ],
      "recordInNotebook": true,
      "notebookNote": "Emma admits she was tempted and approached the table, but claims it was already disturbed. Partial truth or full confession?"
    }
  ],
  "postFailureVariant": {
    "lines": [
      "I heard you made a wrong accusation... That must have been difficult.",
      "Valentin is quite upset, but don't give up. The truth is still here somewhere."
    ],
    "followUpLines": [
      "Keep investigating. You'll find the real culprit.",
      "Everyone makes mistakes. What matters is learning from them."
    ]
  }
}
