{
  "characterId": "klaus",
  "characterName": "Klaus",
  "introduction": {
    "lines": [
      "Greetings! Klaus here. Pleasure to make your acquaintance.",
      "Valentin and I go way back - we studied together at university.",
      "He's been perfecting that erdbeerstrudel recipe for years!"
    ],
    "recordInNotebook": true,
    "notebookNote": "Klaus is an old friend of Valentin's from university. Knows about the strudel recipe history."
  },
  "postIncident": [
    {
      "tier": 0,
      "requiredClues": 0,
      "lines": [
        "Mein Gott, what a disaster! Valentin is beside himself.",
        "I was examining his first edition Goethe when I heard the commotion.",
        "In all my years knowing him, I've never seen him so... unhinged over pastry."
      ],
      "followUpLines": [
        "Valentin always was dramatic about his baking. It's part of his charm.",
        "We must find who did this. For his peace of mind.",
        "Though between you and me, he's been obsessive about this recipe lately..."
      ],
      "recordInNotebook": true,
      "notebookNote": "Klaus was reading when the incident happened. Notes Valentin's been obsessive about the recipe lately."
    },
    {
      "tier": 1,
      "requiredClues": 1,
      "lines": [
        "Ah, you found evidence already. How... thorough.",
        "I should mention - Valentin showed me the recipe last week. Asked for my opinion.",
        "I told him the strawberry ratio was off. Too sweet. He didn't take it well."
      ],
      "followUpLines": [
        "He scribbled angry notes all over the recipe after our talk.",
        "We've been culinary rivals since university. All in good fun... mostly.",
        "But I would never stoop to eating his work just to prove a point!"
      ],
      "recordInNotebook": true,
      "notebookNote": "Klaus criticized Valentin's strudel recipe for being too sweet, which upset Valentin. Old rivalry runs deep."
    },
    {
      "tier": 2,
      "requiredClues": 3,
      "lines": [
        "You're quite the detective. Impressive work so far.",
        "Since we're being thorough - Sebastian was hovering near the dessert table.",
        "I saw him inspect the plate very carefully. Almost clinically. Then he walked away quickly."
      ],
      "followUpLines": [
        "He had this satisfied look afterward. A bit too satisfied.",
        "Sebastian always acts refined, but everyone has their weaknesses.",
        "The plate was suspiciously clean when I glanced at it later..."
      ],
      "recordInNotebook": true,
      "notebookNote": "Klaus saw Sebastian hovering near the dessert table, inspecting the plate carefully, then leaving with a satisfied look."
    },
    {
      "tier": 3,
      "requiredClues": 5,
      "lines": [
        "*long pause* Very well. I'll admit the truth.",
        "I... took a small piece. Just to verify my critique was correct.",
        "And... damn him... it was perfect. He'd fixed the sweetness. It was absolutely perfect."
      ],
      "followUpLines": [
        "Professional jealousy is an ugly thing, my friend.",
        "But I only took a small piece! The rest was already missing when I approached.",
        "It seems several of us couldn't resist. This is a collective crime."
      ],
      "recordInNotebook": true,
      "notebookNote": "Klaus confesses to taking a piece out of professional jealousy to verify his critique. Admits it was perfect. Multiple people involved?"
    }
  ]
}
