{
  "characterId": "luca",
  "characterName": "Luca",
  "introduction": {
    "lines": [
      "Hey there! I'm Luca. Nice party, right?",
      "I only met Valentin recently through mutual friends.",
      "But man, everyone talks about his erdbeerstrudel! Can't wait to try it."
    ],
    "recordInNotebook": true,
    "notebookNote": "Luca is relatively new to the group. Excited about trying the famous strudel."
  },
  "postIncident": [
    {
      "tier": 0,
      "requiredClues": 0,
      "lines": [
        "This is insane! Everyone talks about this strudel like it's the Holy Grail.",
        "Look, I'm new here. I don't know the... politics of Valentin's baking.",
        "I was over by the western bookshelf, completely absorbed in a book about German castles."
      ],
      "followUpLines": [
        "I know how this looks. New guy, mysterious stranger, perfect scapegoat.",
        "But I swear I wouldn't risk my new friendships over pastry!",
        "Check with anyone - I was nowhere near that table when it happened."
      ],
      "recordInNotebook": true,
      "notebookNote": "Luca is new to the group and claims he was reading by the western bookshelf. Worried about being blamed as the outsider."
    },
    {
      "tier": 1,
      "requiredClues": 1,
      "lines": [
        "Evidence? Good! Maybe that will clear my name.",
        "Actually, I can help. I saw crumbs on the floor near the east wall.",
        "And there's a narrow gap behind the tall bookshelf. Perfect for... hiding something?"
      ],
      "followUpLines": [
        "I noticed it because I was trying to see the books on the top shelf.",
        "Someone could easily slip back there if they needed to hide evidence.",
        "I'm trying to prove I'm innocent by being helpful!"
      ],
      "recordInNotebook": true,
      "notebookNote": "Luca noticed crumbs and points out a hiding spot behind the bookshelf. Being helpful or deflecting?"
    },
    {
      "tier": 2,
      "requiredClues": 3,
      "lines": [
        "Alright, I need to tell you something important.",
        "Marianne. She was at the dessert table before Valentin made his announcement.",
        "She was reaching toward it... then pulled back when someone looked her way."
      ],
      "followUpLines": [
        "She's been trying to get his recipe for years, everyone says.",
        "What if she wanted to taste it before everyone else?",
        "That hiding spot behind the bookshelf - perfect place to stash evidence."
      ],
      "recordInNotebook": true,
      "notebookNote": "Luca saw Marianne reaching for the strudel and pulling back when watched. Accurate testimony or convenient accusation?",
      "unlocksClues": ["bookshelf-hiding-spot"]
    },
    {
      "tier": 3,
      "requiredClues": 5,
      "lines": [
        "*defeated sigh* Fine. Yes. I tried it.",
        "Everyone kept going on and on about how legendary it was. I couldn't resist.",
        "I took one piece - ONE! - while people were distracted. But there were already pieces missing!"
      ],
      "followUpLines": [
        "I'm not trying to dodge responsibility. I'm guilty of curiosity.",
        "But this is bigger than me. At least three people took pieces.",
        "We all wanted to try Valentin's famous erdbeerstrudel before it was officially served."
      ],
      "recordInNotebook": true,
      "notebookNote": "Luca confesses to taking one piece out of curiosity, but claims multiple pieces were already missing. Collective crime?"
    }
  ],
  "postFailureVariant": {
    "lines": [
      "I understand you made an incorrect accusation. That's... unfortunate.",
      "Valentin is rather distressed. Perhaps more investigation is needed before another accusation."
    ],
    "followUpLines": [
      "Take your time. Rushing leads to errors.",
      "The evidence will reveal the truth if you look carefully."
    ]
  }
}
