{
  "characterId": "marianne",
  "characterName": "Marianne",
  "introduction": {
    "lines": [
      "Hello, dear. I'm Marianne. So lovely to meet you.",
      "Valentin's parties are always so refined and elegant.",
      "I've been trying to get his erdbeerstrudel recipe for years, but he won't share it!"
    ],
    "recordInNotebook": true,
    "notebookNote": "Marianne has been trying to get Valentin's recipe for years. Interested in his secrets?"
  },
  "postIncident": [
    {
      "tier": 0,
      "requiredClues": 0,
      "lines": [
        "What a terrible thing! And on such a lovely evening.",
        "I was by the window, admiring the sunset over the castle grounds.",
        "The strudel looked absolutely divine from across the room. Such artistry."
      ],
      "followUpLines": [
        "Valentin's been perfecting that recipe for three years, you know.",
        "I've asked him countless times to share it. He always refuses.",
        "Some secrets are meant to be shared, don't you think?"
      ],
      "recordInNotebook": true,
      "notebookNote": "Marianne claims she was by the window. Knows Valentin's been perfecting the recipe for 3 years. She's asked for it many times."
    },
    {
      "tier": 1,
      "requiredClues": 1,
      "lines": [
        "Yes, well... perhaps I wasn't entirely by the window the whole time.",
        "I may have... gravitated toward the dessert table. To admire the craftsmanship.",
        "The layering of the pastry! The glaze! It's technique I've been trying to master for years."
      ],
      "followUpLines": [
        "One can learn so much just from observation, you understand.",
        "I wanted to see how he achieved that perfect golden color.",
        "Professional curiosity. Nothing more."
      ],
      "recordInNotebook": true,
      "notebookNote": "Marianne admits she approached the table to study Valentin's technique. Recipe obsession or cover story?"
    },
    {
      "tier": 2,
      "requiredClues": 3,
      "lines": [
        "Since you're investigating so thoroughly, I should mention Klaus.",
        "He and Valentin had a heated discussion about this very recipe last week.",
        "I overheard Klaus saying the strudel was 'too sweet' and 'needed work.' Valentin was furious."
      ],
      "followUpLines": [
        "Klaus has always been jealous of Valentin's baking prowess.",
        "They're friends, yes, but competitive friends. It gets ugly.",
        "What if Klaus wanted to sabotage it? Or prove it wasn't perfect?"
      ],
      "recordInNotebook": true,
      "notebookNote": "Marianne reveals Klaus criticized the recipe, causing a fight with Valentin. Professional rivalry as motive?"
    },
    {
      "tier": 3,
      "requiredClues": 5,
      "lines": [
        "*composing herself* I see you've pieced it all together.",
        "Yes. I took a piece. I had to understand his technique - the secret ingredient.",
        "Was it vanilla bean? Orange zest? I needed to know for my own baking!"
      ],
      "followUpLines": [
        "It was... transcendent. Layers of flavor I couldn't deconstruct.",
        "But when I took my piece, others had already been there. The strudel was half-gone.",
        "We're all guilty of indulgence. Some of us were just more honest about our reasons."
      ],
      "recordInNotebook": true,
      "notebookNote": "Marianne confesses to taking a piece for professional analysis. Claims strudel was already half-eaten. Collective guilt confirmed?"
    }
  ]
}
