{
  "characterId": "sebastian",
  "characterName": "Sebastian",
  "introduction": {
    "lines": [
      "Good evening. Sebastian. Charmed, I'm sure.",
      "Valentin has impeccable taste in both literature and pastries.",
      "His erdbeerstrudel is legendary. I've been looking forward to this."
    ],
    "recordInNotebook": true,
    "notebookNote": "Sebastian is refined and cultured. Appreciates Valentin's taste in food and books."
  },
  "postIncident": [
    {
      "tier": 0,
      "requiredClues": 0,
      "lines": [
        "What an extraordinary overreaction. Though I suppose Valentin has always been... theatrical.",
        "I was examining his collection of early German poetry. Quite impressive, actually.",
        "The dessert? I glanced at it earlier. Admirable presentation. Very precise technique."
      ],
      "followUpLines": [
        "This lockdown is rather excessive for a missing pastry, don't you think?",
        "Though I suppose it's valuable to him. Sentimentality and all that.",
        "I prefer to remain above such... base conflicts."
      ],
      "recordInNotebook": true,
      "notebookNote": "Sebastian was examining poetry books. Noticed the strudel's presentation and technique. Dismissive of Valentin's reaction."
    },
    {
      "tier": 1,
      "requiredClues": 1,
      "lines": [
        "Ah, you're conducting a proper investigation. How refreshing.",
        "I observed something curious. The plate was immaculate - no crumbs, no residue.",
        "Someone with considerable attention to detail cleaned it. Almost compulsively."
      ],
      "followUpLines": [
        "That level of cleanliness suggests guilt, wouldn't you say?",
        "Or perhaps just refined sensibilities. Hard to tell.",
        "I notice such things. Patterns. Order. Details others miss."
      ],
      "recordInNotebook": true,
      "notebookNote": "Sebastian noticed the plate was suspiciously clean - compulsively so. He seems proud of his observational skills.",
      "unlocksClues": ["empty-plate"]
    },
    {
      "tier": 2,
      "requiredClues": 3,
      "lines": [
        "Your investigative method is quite sound. I can provide additional data.",
        "Emma exhibited classic guilty behavior - averted gaze, defensive posture.",
        "She was near the table longer than she admits. I observed her from the fiction section."
      ],
      "followUpLines": [
        "Body language reveals more than words, don't you think?",
        "She kept glancing at the strudel, then looking away. Fascinating.",
        "Internal conflict between desire and propriety. Textbook."
      ],
      "recordInNotebook": true,
      "notebookNote": "Sebastian claims Emma showed guilty body language and lingered near the table. Clinical observation or calculated misdirection?"
    },
    {
      "tier": 3,
      "requiredClues": 5,
      "lines": [
        "*adjusts collar* Very well. I shall confess with precision.",
        "I consumed approximately 40% of the remaining strudel. I measured it mentally.",
        "My method was systematic - I cut clean portions, savored each layer, cleaned the plate afterward."
      ],
      "followUpLines": [
        "The craftsmanship was exceptional. Each bite revealed new dimensions.",
        "When I arrived, roughly 30% was already missing. Three distinct cutting patterns.",
        "This was a crime of collective indulgence. I was simply the most thorough."
      ],
      "recordInNotebook": true,
      "notebookNote": "Sebastian confesses to eating 40% of the strudel with methodical precision. Claims 30% was already gone with three cutting patterns. He's the most detailed culprit."
    }
  ]
}
