{
  "characterId": "valentin",
  "characterName": "Valentin",
  "introduction": {
    "lines": [
      "Welcome, welcome! I'm so thrilled you could all make it to my little gathering!",
      "Now, I know what you're all thinking... Yes, I've prepared it. My FAMOUS erdbeerstrudel!",
      "This isn't just any strudel, mind you. It's made with the finest Austrian butter, hand-picked strawberries from my garden, and a secret ingredient passed down through three generations of my family.",
      "The pastry alone takes four hours to prepare - each layer folded with the precision of a master craftsman. And the filling? Ah, the filling is what makes it legendary!",
      "People have traveled from across the continent just to taste this masterpiece. One food critic called it a symphony of flavors that dances on the tongue.",
      "It's cooling in the kitchen right now, reaching the perfect temperature. The aroma alone should be intoxicating!",
      "Please, make yourselves comfortable. Explore the library, chat amongst yourselves. I'll return shortly with the erdbeerstrudel, and we shall all share in this culinary triumph together!"
    ],
    "recordInNotebook": true,
    "notebookNote": "Valentin is hosting the party. He made his famous erdbeerstrudel - apparently it's legendary and took hours to make with a secret family recipe."
  },
  "postIncident": [
    {
      "tier": 0,
      "requiredClues": 0,
      "lines": [
        "MEIN ERDBEERSTRUDEL! It's... it's partially eaten!",
        "Three hours! THREE HOURS I worked on the dough! The perfect strawberries from my garden!",
        "No one leaves this library until I know who touched my masterpiece!"
      ],
      "followUpLines": [
        "Look for evidence! Crumbs, napkins, anything!",
        "Someone in this room has strawberry on their conscience!",
        "Interview everyone. Make them confess their sins against pastry!"
      ],
      "recordInNotebook": true,
      "notebookNote": "Valentin discovered his strudel partially eaten. He's distraught and has locked down the library until the culprit is found."
    },
    {
      "tier": 1,
      "requiredClues": 1,
      "lines": [
        "Ah! You found evidence! Gut, gut!",
        "This is like putting together a jigsaw puzzle of betrayal.",
        "Keep searching. Every crumb tells a story, ja?"
      ],
      "followUpLines": [
        "Talk to everyone. Someone knows something!",
        "My beautiful creation... why would they do this?",
        "The truth is close. I can feel it in my baker's bones!"
      ],
      "recordInNotebook": true,
      "notebookNote": "Valentin is emotionally invested but wants justice. He's depending on me to solve this."
    },
    {
      "tier": 2,
      "requiredClues": 3,
      "lines": [
        "Three clues! You are like Sherlock Holmes but for German pastries!",
        "I am starting to see the pattern... multiple people near my strudel...",
        "Mein Gott... was it... was it more than one person?"
      ],
      "followUpLines": [
        "Could they have conspired? Or each acted alone?",
        "The betrayal runs deeper than I thought...",
        "Find more evidence. I need to know everyone who touched it!"
      ],
      "recordInNotebook": true,
      "notebookNote": "Valentin is realizing multiple people might be involved. His world is crumbling."
    },
    {
      "tier": 3,
      "requiredClues": 5,
      "lines": [
        "Five clues... Das ist... this is comprehensive.",
        "I invited these people into my home. My FRIENDS. And they...",
        "I think I understand now. It was all of them, wasn't it? Working together? Or... independently but simultaneously?"
      ],
      "followUpLines": [
        "I need you to confront them. Find out the full truth.",
        "Who took the first bite? Who took the most? I must know!",
        "My heart is breaking, but my mind demands answers!"
      ],
      "recordInNotebook": true,
      "notebookNote": "Valentin suspects collective guilt. He wants confrontation and full confessions from everyone involved."
    }
  ],
  "accusationInitiation": {
    "default": [
      {
        "text": "Have you figured out who ate my erdbeerstrudel? Do you know who the culprit is?",
        "options": [
          {
            "text": "I think I know who did it",
            "action": "initiate-accusation"
          },
          {
            "text": "Not yet, I need more evidence",
            "action": "continue-investigation"
          }
        ]
      }
    ],
    "afterFirstFailure": [
      {
        "text": "You... you already made one wrong accusation. Please, be more careful this time. I can't take much more of this...",
        "options": [
          {
            "text": "I think I know who did it",
            "action": "initiate-accusation"
          },
          {
            "text": "Let me investigate more",
            "action": "continue-investigation"
          }
        ]
      }
    ],
    "insufficientEvidence": [
      {
        "text": "You don't have enough evidence yet! Please, find more clues before making an accusation. I need solid proof!",
        "options": [
          {
            "text": "I'll keep investigating",
            "action": "continue-investigation"
          }
        ]
      }
    ]
  }
}
