{
  "characterId": "valentin",
  "characterName": "Valentin",
  "introduction": {
    "lines": [
      "Welcome, welcome! I'm so thrilled you could all make it to my little gathering!",
      "Now, I know what you're all thinking... Yes, I've prepared it. My FAMOUS erdbeerstrudel!",
      "This isn't just any strudel, mind you. It's made with the finest Austrian butter, hand-picked strawberries from my garden, and a secret ingredient passed down through three generations of my family.",
      "The pastry alone takes four hours to prepare - each layer folded with the precision of a master craftsman. And the filling? Ah, the filling is what makes it legendary!",
      "People have traveled from across the continent just to taste this masterpiece. One food critic called it a symphony of flavors that dances on the tongue.",
      "It's cooling in the kitchen right now, reaching the perfect temperature. The aroma alone should be intoxicating!",
      "Please, make yourselves comfortable. Explore the library, chat amongst yourselves. I'll return shortly with the erdbeerstrudel, and we shall all share in this culinary triumph together!"
    ],
    "recordInNotebook": true,
    "notebookNote": "Valentin is hosting the party. He made his famous erdbeerstrudel - apparently it's legendary and took hours to make with a secret family recipe."
  },
  "postIncident": [
    {
      "tier": 0,
      "requiredClues": 0,
      "lines": [
        "My erdbeerstrudel! Someone ate it!",
        "I won't let anyone leave until I find out who did this!",
        "Please, help me investigate. Look around for any clues."
      ],
      "followUpLines": [
        "Have you found anything yet?",
        "Someone in this room is guilty, I'm certain of it.",
        "Please, keep searching. There must be evidence somewhere."
      ],
      "recordInNotebook": false
    },
    {
      "tier": 1,
      "requiredClues": 1,
      "lines": [
        "You found something? Let me see...",
        "Interesting... This could be important.",
        "Keep investigating. Every clue brings us closer to the truth."
      ],
      "followUpLines": [
        "Any new discoveries?",
        "The evidence is mounting...",
        "Have you talked to everyone? Someone knows more than they're saying."
      ],
      "recordInNotebook": true,
      "notebookNote": "Valentin is genuinely upset about the missing strudel. He's counting on me to find the culprit."
    },
    {
      "tier": 2,
      "requiredClues": 3,
      "lines": [
        "Three clues already? You're quite the detective!",
        "I remember seeing someone near that napkin earlier...",
        "But I can't quite place who it was. Maybe if you find more evidence?"
      ],
      "followUpLines": [
        "The pieces are coming together, aren't they?",
        "Someone's story doesn't add up. I can feel it.",
        "Keep pressing. The truth will reveal itself."
      ],
      "recordInNotebook": true,
      "notebookNote": "Valentin saw someone near the napkin but can't remember who. His memory seems selective."
    },
    {
      "tier": 3,
      "requiredClues": 5,
      "lines": [
        "Five clues! You've been thorough.",
        "I... I think I know who did it now.",
        "But I want to hear your conclusion first. Who do you believe ate my erdbeerstrudel?"
      ],
      "followUpLines": [
        "Take your time. Review all the evidence.",
        "When you're ready, make your accusation.",
        "Choose carefully. There's only one guilty party here."
      ],
      "recordInNotebook": true,
      "notebookNote": "Valentin claims to know the culprit but wants me to solve it myself. Testing me?"
    }
  ]
}
